export const THEORY_MAPPING = {
    // 天干映射
    甲: '木', 乙: '木',
    丙: '火', 丁: '火',
    戊: '土', 己: '土',
    庚: '金', 辛: '金', 
    壬: '水', 癸: '水',
    
    // 地支映射: 
    子: '坎', 丑: '艮',
    寅: '艮', 卯: '震',
    辰: '巽', 巳: '巽',
    午: '离', 未: '坤',
    申: '坤', 酉: '兑',
    戌: '乾', 亥: '乾'
    
};

// export const THEORY_MAPPING = {
//     甲: ['木'],
//     乙: ['木'],
//     丙: ['火'],
//     丁: ['火'],
//     戊: ['土'],
//     己: ['土'],
//     庚: ['金'],
//     辛: ['金'],
//     壬: ['水'],
//     癸: ['水'],
    
//     子: ['坎'],
//     丑: ['艮'],
//     寅: ['艮'],
//     卯: ['震'],
//     辰: ['巽'],
//     巳: ['巽'],
//     午: ['离'],
//     未: ['坤'],
//     申: ['坤'],
//     酉: ['兑'],
//     戌: ['乾'],
//     亥: ['乾'],
// }