export const POKEMON_TYPE_MAPPING  = {
    /* 五行主属性 */
    木: ['草', '虫'],          // 木主生发
    火: ['火', '格斗'],        // 火主炎上
    土: ['地面', '岩石'],      // 土主稼穑 
    金: ['钢', '恶'],          // 金主从革
    水: ['水', '冰'],          // 水主润下

    /* 八卦副属性 */
    乾: ['电', '龙'],         // 乾为天
    坤: ['一般', '妖精'],     // 坤为地
    震: ['飞行'],             // 震为雷
    巽: ['超能力'],           // 巽为风
    坎: ['毒'],               // 坎为水
    离: ['幽灵'],             // 离为火
    艮: [],                   // 艮为山（暂未分配）
    兑: []                    // 兑为泽（暂未分配）
}